In [1]:
import numpy as np
import pandas as pd

In [3]:
obj = pd.Series(np.arange(5),
                index = ['a','b','c','d','e'])
obj

a    0
b    1
c    2
d    3
e    4
dtype: int32

In [4]:
obj["c"]

2

In [9]:
obj[:3]

a    0
b    1
c    2
dtype: int32

In [10]:
obj[["a" , "c"]]

a    0
c    2
dtype: int32

In [12]:
obj[[0,2]]

a    0
c    2
dtype: int32

In [14]:
obj[obj<2]

a    0
b    1
dtype: int32

In [16]:
obj["a" : "c"]

a    0
b    1
c    2
dtype: int32

In [18]:
obj["b":"c"]=5
obj

a    0
b    5
c    5
d    3
e    4
dtype: int32

DATA FRAME

In [25]:
data = pd.DataFrame(
    np.arange(16)#.reshape(4,4),
   # index = ["London","Paris","Berlin","Istanbul"],
   # columns = ["one","two","three","four"]
)
data

     0
0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9
10  10
11  11
12  12
13  13
14  14
15  15

In [26]:
data = pd.DataFrame(
    np.arange(16).reshape(4,4),
    index = ["London","Paris","Berlin","Istanbul"],
    columns = ["one","two","three","four"]
)
data

          one  two  three  four
London      0    1      2     3
Paris       4    5      6     7
Berlin      8    9     10    11
Istanbul   12   13     14    15

In [28]:
data["two"]

London       1
Paris        5
Berlin       9
Istanbul    13
Name: two, dtype: int32

In [29]:
data[:3]

        one  two  three  four
London    0    1      2     3
Paris     4    5      6     7
Berlin    8    9     10    11

In [30]:
data[:"Berlin"]

        one  two  three  four
London    0    1      2     3
Paris     4    5      6     7
Berlin    8    9     10    11

In [40]:
#Removin less than 5 term on forth column
data[data["four"]>5]

          one  two  three  four
Paris       4    5      6     7
Berlin      8    9     10    11
Istanbul   12   13     14    15

In [42]:
#Replacing datas less than 5 with zero
data[data < 5] = 0
data

          one  two  three  four
London      0    0      0     0
Paris       0    5      6     7
Berlin      8    9     10    11
Istanbul   12   13     14    15

In [43]:
#loc and iloc
data.iloc[1]

one      0
two      5
three    6
four     7
Name: Paris, dtype: int32

In [45]:
data.loc["Paris"]

one      0
two      5
three    6
four     7
Name: Paris, dtype: int32

In [46]:
data.iloc[1,[1,2,3]]

two      5
three    6
four     7
Name: Paris, dtype: int32

In [50]:
data.loc["Paris",["two","three","four"]]

two      5
three    6
four     7
Name: Paris, dtype: int32

In [54]:
toy_data = pd.Series(np.arange(5),
                index = ['a','b','c','d','e'])
toy_data

a    0
b    1
c    2
d    3
e    4
dtype: int32

In [55]:
toy_data[-1]

4